{
	"close": "Close",
	"menu": "Menu",
	"navigation": "Quick Navigation",

	"home": "Home",
	"about": "About me",
	"achievement": "Achievements",
	"experience": "Experience",
	"projects": "Projects",
	"contact": "Contact",
	"welcome": "Welcome",
	"description": "This is a sample description.",
	"languageBtnEn": "Switch to English",
	"languageBtnKh": "Switch to Khmer",
	"lightModeBtn": "Switch to Light Mode",
	"darkmodeBtn": "Switch to Dark Mode",
	"quickNav": "Quick Navigation",
	"newOpportunities": "Looking for new opportunities",
	"hello_there": "Hello there, I'm ",
	"name": "Nim Vatna",
	"position": "Web Developer",
	"followme": "Follow Me",
	"location": "Phnom Penh, Cambodia",
  	"language_skill" : "Khmer and English Speaker",
  	"experience_home" : "1 Years Experience",
	"withOver": "with over",
	"oneYear": "1 years of experience",
	"focusOnDeliver": "in web development, I focus on delivering high-quality solutions that combine",
	"modernDesign": "modern design",
	"and": "and",
	"cleanCode": "clean code",
	"like": "I love working with",
	"talk": "to build scalable applications, while always paying attention to detail and user experience. Every project is an opportunity to grow, learn, and create something impactful.",
	"contactme": "contact me",
	"downloadCv": "Download CV",
	"projectDone": "4+ Projects completed",

	"aboutHeader1": "Designing with creativity,",
	"aboutHeader2": "Building with purpose",
	"paragraphAbout1": "I focus on building responsive and user-centric web applications with a strong command of",
	"paragraphAbout2": "Alongside front-end development, I integrate",
	"paragraphAbout3": "third-party services",
	"paragraphAbout4": "to create seamless, functional, and dynamic user experiences.",
	"field": "Field",
	"fieldDetail": "Web Development",
	"focus": "Focus",
	"focusDetail": "Frontend Web Development",
	"birthDate": "Birthdate",
	"birthdateDate": "01-Dec-2002",
	"locationAbout": "Address",
	"locationDate": "Phnom Penh, Cambodia",
	"tel": "Tel",
	"email": "Email",
	"techologayHeader": "Languages & Technology",
	"SupportingToolHeader": "Supporting Tools",
	"uiTool": "UI Tools",
	"dataTool": "Data Tools",
	"verionControl": "Version Control",

	"education": "Education",
	"certifications": "Certifications",
	"royelUniversity": "Royal University of Phnom Penh",
	"royelmajor": "Bachelor of Science in Computer Science and Engineering",
	"royelYear": "Graduated 2021 – 2025 (Generation 25)",
	"toulTompong": "Toul Tumpong High School, Phnom Penh",
	"toulTompongmajor": "High School",
	"toulTompongYear": "Bacll 2019 – 2020",
	"beltei": "Beltei International School, Phnom Penh",
	"belteimajor": "General English Languages (ESL 12)",
	"belteiYear": "Graduated 2017 – 2020",
	"&" : "&",
	"royelCertYear": "2025 (Generation 25)",
	"highschoolYear": "Year 2019 - 2020",
	"bacll": "Bacll",
	"year12": "Year 2020",
	"year6": "Year 2017",
	"computerSchool": "Computer Vocational Training Organization",
	"computerYear": "Year 2022",
	"belteimajor6": "General English Languages (ESL 6)",
	"view": "View",

	"titleExp1": "Career Progression",
	"titleExp2": "Hands-on Experience, Tangible Results",
	"titleExp3": "I specialize in delivering high-value solutions through modular components, maintainable architecture, and performance optimization.",
	"footer": "Ready for new journey",
	"keyAchi": "Key Achivment",
	"repAndWork": "work & responsible",
	"viewMoreBtn": "View More Information",
	"shift": "Fulltime",
	"gtechPosition": "Frontend Developer",
	"gtechWorkTime": "Apr 2024 – Apr 2025",
	"gtechlocation": "Phnom Penh, Cambodia",
	"gtechDescription": "Completed a 3-month internship and was promoted by the Senior Front-End Web Developer in recognition of strong performance and growth. Continued working in the role for one year.",
	"gtechAchi1": "Built 3 frontend projects and maintained 2 applications",
	"gtechAchi2": "Designed smooth and modern UI using Nuxt and Nuxt UI",
	"gtechAchi3": "Integrated frontend components with REST APIs",
	"gtechResp1": "Developed responsive user interfaces using HTML, CSS(Tailwind), JavaScript, TypeScript and Nuxt.js to ensure smooth performance across desktop, tablet and mobile device",
    "gtechResp2": "Gained experience maintaining the company website, including updating the UI and integrating API data.",
    "gtechResp3": "Optimized website performance by implementing lazy loading, reducing asset sizes, and improving load times using tools like Vite and Webpack.",
    "gtechResp4": "Integrated front-end components with RESTful APIs, ensuring seamless communication between client and sever using JSON data formats.",
    "gtechResp5": "Used Git for version control and collaborated with team members via GitHub to manage branches all pull requests efficiently.",
    "gtechResp6": "Tested and debugged API response, handle HTTP method (GET, POST, PUT, DELETE), and ensured smooth data flow to the frontend.",
    "gtechResp7": "Used tools like Postman, Hopscotch and browser developer tools to test back-end API endpoints and analyze request/response cycles for debugging and integration purposes.",
    "gtechResp8": "Leveraged Nuxt UI components to build dynamic user interfaces, ensuring consistent design and smooth functionality across different device.",
	"pedroPosition": "Visual Merchandiser Assistant & Customer Service Exclusive",
	"pedroWorkTime": "Feb 2022 – Jul 2023",
	"pedrolocation": "AEon mall, Phnom Penh",
	"pedroDescription": "Promoted to Visual Merchandiser Assistant after 6 months in Customer Service Exclusive by the Sale Supervisor and Visual Merchandising Manager in recognition of exceptional performance and creativity.",
	"pedroAchi1": "Achieved Top 3 in store product display every month",
	"pedroAchi2": "Consistently hit sales targets and ranked among top sales",
	"pedroAchi3": "Participated in role-playing contest as a brand representative",
	"pedroResp1": "Assisted in planning and executing store displays in line with brand guidelines and seasonal or promotional campaigns.",
    "pedroResp2": "Maintained store visuals to attract customers and boost product visibility.",
    "pedroResp3": "Managed store props and generated monthly reports.",
    "pedroResp4": "Collaborated with the merchandising team to implement visual strategies based on sales data, customer feedback, and market trends.",
    "pedroResp5": "Handled transactions, inquiries, and complaints with efficiency and professionalism.",
    "pedroResp6": "Built strong rapport with clients through product knowledge and personalized assistance.",
    "pedroResp7": "Consistently met sales and customer satisfaction targets.",
	"kiwiPosition": "Cashier",
	"kiwiWorkTime": "Jun 2020 – Jan 2021",
	"kiwilocation": "Phnom Penh, Cambodia",
	"kiwiAchi1":  "Used POS systems to handle payments and checked receipts correctly.",
	"kiwiAchi2":  "Helped train new staff members on the register and provided guidance on store procedures.",
	"kiwiResp1": "Provided fast, accurate, and friendly checkout service while handling various payment methods in a high-volume retail environment, and Reported daily revenue and ensured accurate cash drawer reconciliation with attention to detail and accuracy.",
    "kiwiResp2": "Maintained a clean and organized checkout area, ensuring safety and neatness.",
    "kiwiResp3": "Used POS systems to handle payments (Cash, Card or Vouchers) and checked receipts correctly.",
    "kiwiResp4": "Helped train new staff members on the register and provided guidance on store procedures.",

	"featuredWork": "Featured Work",
	"projectTitle1": "Take a look at some of my featured work. I focus on creating modern, creative, and user-friendly projects that highlight both design and functionality. Each project reflects my dedication to quality and detail.",
	"projectTitle2": "Interested in seeing more of my work?",
	"viewAllProject": "view all project",
	"viewProject": "View Project",
	"viewGithubModal": "View the source code for Task Management App",
	"demoProjectTitle": "Demo project Images",
	"technology": "technology",
	"details": "Details",
	"followUs": "Follow Me",
	"explore": "explore",
	"myProject": "My Project",
	"titleProject": "Build for love, grow with passion.",
	"realTimeProject": "Realtime Project",
	"projectCard1": "Personal Portfolio V2.0 is a modern, fully responsive website designed to showcase my skills, projects, and professional experience. Built with Nuxt, TypeScript, Tailwind CSS, and Nuxt UI, it features smooth animations, interactive sections, and a clean, minimal design. The project highlights my focus on performance and usability",
	"projectCard2": "A modern, responsive personal portfolio website showcasing my skills, projects, and experience. Built using React with TypeScript, Tailwind CSS, and Material UI, it includes interactive sections, smooth animations, and a clean design to highlight my development work and contact information.",
	"projectCard3": "A front-end training project for a coffee shop website with a clean UI, responsive layout, and modular structure. This project was built for self-learning and runs locally using \"npm run dev\". It integrates with the \"Robert Coffee (Back-End)\" service for login authentication and uses REST APIs for data handling and communication.",
	"projectCard4": "A backend training project built with Laravel and MySQL to support the Robert Coffee front-end. This project was developed as part of my self-learning journey to practice server-side development. It runs locally using XAMPP Control Panel v3.3.0 and provides RESTful APIs for authentication and data operations",
	"projectCard5": "A static website built during my first experience learning a front-end framework. Developed using Nuxt.js, this project simulates a skin care product ordering site and helped me understand the fundamentals of Vue, Tailwind CSS, and component-based development. It was a personal learning project focused on layout structure, styling, and rendering static content effectively",
	"projectCard6": "A static website built during my first experience learning a front-end framework. Developed using Nuxt.js, this project simulates a skin care product ordering site, helping me understand the fundamentals of Vue, Tailwind CSS, and component-based development. It was a personal learning project focused on layout structure, styling, and static content rendering.Read",
	"projectCard7": "A static website built during my first experience learning a front-end framework. Developed using Nuxt.js, this project simulates a skin care product ordering site, helping me understand the fundamentals of Vue, Tailwind CSS, and component-based development. It was a personal learning project focused on layout structure, styling, and static content rendering",
	"projectCard8": "A Nuxt.js project created to deepen my understanding of modern frontend frameworks and REST API integration. The application showcases photographer profiles and testimonials, with dynamic data fetched from a backend API. It was developed as a self-learning exercise using TypeScript and Tailwind CSS. The project runs locally using \"npm run dev\" for the client and open one more terminal and run this command-line \"npx json-server --watch static/data/photographyDb.json --port 3001\" for the backend.",
	"projectCard9": "Developed the frontend interface of the Gtech Admin panel, implementing responsive UI components and integrating with backend APIs. Focused on debugging, improving user experience, and ensuring seamless interaction with the admin dashboard.",
	"projectCard10": "Worked on maintaining and improving the Gtech Cambodia website. Implemented API integrations, optimized frontend performance, and ensured cross-browser compatibility. Focused on clean UI and smooth interactions for end-users.",
	"projectCard11": "Built the frontend dashboard for Sambot Digital Admin, creating interactive components and ensuring smooth integration with backend APIs. Focused on improving user experience and providing an efficient workflow for digital management.",
	"projectCard12": "Developed reusable frontend templates for the Sambot Digital Mail system. Followed UI guidelines to create a digital mail platform for customers to send invitations for ceremonies such as weddings, birthdays, and other events.",
	"projectCard13": "Developed the frontend interface for the Samphat Motobike POS System. Implemented responsive layouts, interactive components, and smooth navigation to enhance the experience for staff managing orders and inventory.",
			
	"contactTitle1": "Let's work Together",
	"contactTitle2": "Hi there! I hope you’re having a great day. It’s always nice to connect and share good vibes with others!",
	"contactTitle3": "Scan the QR code below to support me.Thank you so much!🙏",
	"getInTouch": "Get in Touch",
	"getInTouch2": " I’d love to hear from you! Feel free to reach out anytime and say hello.",
	"connectWithMe": "Connect with me",
	"connectWithMe2": "Feel free to reach out anytime—I’m always happy to meet new people and share ideas!",
	"supportMe": "Support ME",
	"sendEmail": "send email",
	"sendingEmail": "sending email",
	"sendingpara": "Hi there! Fill out the form below and I’ll get back to you as soon as possible.",
	"sendMessage": "Send Message",
	"sending": "Sending...",
	"nameCon": "Name",
	"namePlaceholder": "Your Fullname",
	"subject": "Subject",
	"subjectPlaceholder": "What's this about?",
	"message": "Message",
	"messagePlaceholder": "Write message...",

	"quickLink": "Quick Links",
	"footerTitle1": "Let's Connect with me",
	"footerTitle2": "Always interested in new opportutie and collubalution.",
	"2025": "2025",
	"designFt": "Design",
	"coded":"coded",
	"byFt": "by Nim Vatna",
	"viewPortflio": "View Portflio",
	"callMe": "Call Me",
	"sayHelloTelegram": "Say hi to my Telegram!",
	"latestWork": "Latest Work",
	"demoProject": "Demo Project Video"
}	
