{
	"close": "បិទ",
	"menu": "មីនុយ",
	"navigation": "ការរុករករហ័ស",

    "home": "ទំព័រដើម",
    "about": "អំពីខ្ញុំ",
    "achievement": "សមិទ្ធិផល",
    "experience": "បទពិសោធន៍",
    "projects": "គម្រោង",
    "contact": "ទំនាក់ទំនង",
    "welcome": "សូមស្វាគមន៍",
    "description": "នេះគឺជាការពិពណ៌នាគំរូ។",
    "languageBtnEn": "ប្ដូរទៅជាភាសាអង់គ្លេស",
    "languageBtnKh": "ប្ដូរទៅជាភាសាខ្មែរ",
    "darkmodeBtn": "ប្ដូរទៅមុខងារងងឹត",
    "lightModeBtn": "ប្ដូរទៅមុខងារភ្លឺ",
    "quickNav": "ការរុករករហ័ស",
    "newOpportunities": " កំពុងស្វែងរកឱកាសថ្មី",
    "hello_there": "សួស្តី ខ្ញុំគឺ",
    "name": "នីម​ វឌ្ឍា",
    "position": "អ្នកអភិវឌ្ឍន៍គេហទំព័រ",
    "followme" : "តាមខ្ញុំ",
    "location": "ភ្នំពេញ, កម្ពុជា",
  	"language_skill" : "អាចនិយាយភាសាខ្មែរ និង អង់គ្លេស",
    "experience_home" : "មានបទពិសោធន៍ ១ ឆ្នាំ",
    "withOver": " ជាមួយបទពិសោធន៍",
    "oneYear": "១ ឆ្នាំ",
    "focusOnDeliver": "ក្នុងការអភិវឌ្ឍគេហទំព័រ សមត្ថភាពរបស់ខ្ញុំផ្តោតលើការផ្តល់ដំណោះស្រាយដែលមានគុណភាពខ្ពស់ដែលបញ្ចូល",
	"modernDesign": "រចនាទំនើប",
	"and": "និង",
	"cleanCode": "កូដស្អាត",
	"like": "ខ្ញុំចូលចិត្តធ្វើការជាមួយ",
	"talk": "ដើម្បីបង្កើតកម្មវិធីដែលអាចពង្រីកបាន ខណៈពេលក៏ផ្តល់ចំណាប់អារម្មណ៍លើព័ត៌មានលម្អិត និង បទពិសោធន៍អ្នកប្រើផងដែរ។ គម្រោងនីមួយៗ គឺជាឱកាសក្នុងការលូតលាស់ រៀន និងបង្កើតអ្វីដែលមានឥទ្ធិពល។",
	"contactme": "ទំនាក់ទំនងមកខ្ញុំ",
	"downloadCv": "ទាញយក CV",
	"projectDone": "គម្រោង ៤+ បានបញ្ចប់",

	"aboutHeader1": "រចនាដោយការច្នៃប្រឌិត,",
	"aboutHeader2": "ស្ថាបនាដោយគោលបំណង",
	"paragraphAbout1": "ខ្ញុំផ្តោតលើការបង្កើតកម្មវិធីវេបដែលឆ្លើយតប និងផ្តោតលើអ្នកប្រើដោយមានជំនាញខ្ពស់ក្នុង",
	"paragraphAbout2": "ក្រៅពីការអភិវឌ្ឍផ្នែកមុខ ខ្ញុំបញ្ចូល",
	"paragraphAbout3": "សេវាកម្មភាគីទីបី",
	"paragraphAbout4": "ដើម្បីបង្កើតបទពិសោធន៍អ្នកប្រើដែលរលូន មានប្រសិទ្ធភាព និងមានភាពសកម្ម។",
	"field": "វិស័យ",
	"fieldDetail": "ការអភិវឌ្ឍគេហទំព័រ",
	"focus": "ផ្តោតលើ",
	"focusDetail": "ការអភិវឌ្ឍផ្នែកមុខវេបសាយ",
	"birthDate": "ថ្ងៃកំណើត",
	"birthdateDate": "01-ធ្នូ-2002",
	"locationAbout": "អាសយដ្ឋាន",
	"locationDate": "ភ្នំពេញ, កម្ពុជា",
	"tel": "លេខទូរស័ព្ទ",
	"email": "អ៊ីមែល",
	"techologayHeader": "ភាសា និងបច្ចេកវិទ្យា",
	"SupportingToolHeader": "ឧបករណ៍គាំទ្រ",
	"uiTool": "ឧបករណ៍ រចនាបថ",
	"dataTool": "ឧបករណ៍ទិន្នន័យ",
	"verionControl": "ការគ្រប់គ្រងកំណែទម្រង់",

	"education": "ការអប់រំ",
	"certifications": "វិញ្ញាបនប័ត្រ",
	"royelUniversity": "សាកលវិទ្យាល័យភូមិន្ទភ្នំពេញ",
	"royelmajor": "បរិញ្ញាបត្រវិទ្យាសាស្ត្រកុំព្យូទ័រ និងវិស្វកម្ម",
	"royelYear": "បញ្ចប់ឆ្នាំសិក្សា ២០២១ – ២០២៥ (ជំនាន់ទី២៥)",
	"toulTompong": "វិទ្យាល័យទួលទំពូង, ភ្នំពេញ",
	"toulTompongmajor": "ថ្នាក់វិទ្យាល័យ",
	"toulTompongYear": "បាក់ឌុបនៅឆ្នាំ ២០១៩ – ២០២០",
	"beltei": "សាលា ប៊ែលធី អន្តរជាតិ, ភ្នំពេញ",
	"belteimajor": "ភាសាអង់គ្លេសទូទៅ (ESL 12)",
	"belteiYear": "បញ្ចប់ការសិក្សាឆ្នាំ ២០១៧ – ២០២០",
	"&" : "និង",
	"royelCertYear": "២០២៥ (ជំនាន់ទី ២៥)",
	"highschoolYear": "ឆ្នាំសិក្សា​ ២០១៩​ - ២០២០",
	"bacll": "បាក់ឌុប",
	"year12": "ឆ្នាំសិក្សា​​ ២០២០",
	"year6": "ឆ្នាំសិក្សា​ ២០១៧",
	"computerSchool": "អង្គការបណ្តុះបណ្តាលវិជ្ជាជីវៈកុំព្យូទ័រ",
	"computerYear": "ឆ្នាំសិក្សា​ ២០២០",
	"belteimajor6": "ភាសាអង់គ្លេសទូទៅ (ESL 6)",
	"view": "មេីល",

	"titleExp1": "ការរីកចម្រើនក្នុងអាជីព",
	"titleExp2": "បទពិសោធន៍អនុវត្ត និងលទ្ធផលដែលអាចមើលឃើញ",
	"titleExp3": "ខ្ញុំផ្តោតលើការផ្តល់ដំណោះស្រាយមានតម្លៃខ្ពស់ តាមរយៈបច្ចេកវិទ្យាដែលអាចបែងចែកបាន ស្ថាបត្យកម្មដែលងាយថែរក្សា និងការកែលម្អកម្រិតប្រសិទ្ធភាព។",
	"footer": "ត្រៀមខ្លួនសម្រាប់ដំណើរថ្មី",
	"keyAchi": "សមិទ្ធផលសំខាន់",
	"repAndWork": "ការងារ និង ទំនួលខុសត្រូវ",
	"viewMoreBtn": "មើលព័ត៌មានបន្ថែម",
	"shift": "ពេញម៉ោង",
    "gtechPosition": "អ្នកអភិវឌ្ឍន៍រចនាបថគេហទំព័រ",
    "gtechWorkTime": "មេសា 2024 – មេសា 2025",
    "gtechlocation": "ភ្នំពេញ, កម្ពុជា",
    "gtechDescription": "បញ្ចប់ការបណ្តុះបណ្តាលរយៈពេល 3 ខែ និងត្រូវបានដំឡើងឲ្យកា្លយជាបុគ្គលិកពេញម៉ោង ដោយ Senior Front-End Web Developer ក្នុងការទទួលស្គាល់ការអនុវត្ត និងការរីកចម្រើន។ បន្តការងារនៅតួនាទីនេះរយៈពេលមួយឆ្នាំ។",
    "gtechAchi1": "បង្កើតគម្រោង frontend 3 គម្រោង និងថែទាំកម្មវិធី 2 គម្រោង",
    "gtechAchi2": "រចន UI Smooth និងទាន់សម័យដោយប្រើ Nuxt និង Nuxt UI",
    "gtechAchi3": "បញ្ចូលរួម frontend ជាមួយ REST APIs",
    "gtechResp1": "អភិវឌ្ឍ UI ដែលឆបគ្នា (Responsive) ដោយប្រើ HTML, CSS(Tailwind), JavaScript, TypeScript និង Nuxt.js ដើម្បីធានាបាននូវការប្រតិបត្តិSmooth លើ desktop, tablet និង ទូរសព្ទ័",
    "gtechResp2": "ទទួលបទពិសោធន៍ក្នុងការថែទាំគេហទំព័ររបស់ក្រុមហ៊ុន រួមទាំងធ្វើឱ្យ UI ថ្មី និងបញ្ចូល API data។",
    "gtechResp3": "ធ្វើឱ្យគេហទំព័រប្រតិបត្តិការលឿនជាងមុនដោយប្រើ lazy loading បន្ថយទំហំ assets និងធ្វើឱ្យ load times លឿនជាងមុន ដោយប្រើឧបករណ៍ដូចជា Vite និង Webpack។",
    "gtechResp4": "បញ្ចូល front-end ជាមួយ RESTful APIs ដើម្បីធានាការទំនាក់ទំនងរលូនរវាង client និង server ដោយប្រើ JSON data formats។",
    "gtechResp5": "ប្រើ Git សម្រាប់ version control និងសហការជាមួយសមាជិកក្រុមតាម GitHub ដើម្បីគ្រប់គ្រង branches និង pull requests ជាប្រសិទ្ធភាព។",
    "gtechResp6": "សាកល្បង និងកែបញ្ហា API response, គ្រប់គ្រង HTTP methods (GET, POST, PUT, DELETE) និងធានាបាននូវ data flow ល្អទៅ frontend។",
    "gtechResp7": "ប្រើឧបករណ៍ដូចជា Postman, Hopscotch និង browser developer tools ដើម្បីសាកល្បង back-end API endpoints និងវិភាគ request/response cycles សម្រាប់ debugging និង integration។",
    "gtechResp8": "ប្រើ Nuxt UI components ដើម្បីបង្កើត UI ដែលមាន dynamic, ធានាបាននូវការរចនាដូចគ្នា និងប្រតិបត្តិការល្អលើ devices ផ្សេងៗ។",
    "pedroPosition": "ជំនួយការប្រតិបត្តិការ Visual Merchandiser និង Customer Service Exclusive",
    "pedroWorkTime": "កុម្ភៈ 2022 – កក្កដា 2023",
    "pedrolocation": "ផ្សារទំនើបអ៊ីអន, ភ្នំពេញ",
    "pedroDescription": "ត្រូវបានដំឡើងឲ្យកា្លយជា Visual Merchandiser Assistant បន្ទាប់ពី ៦ ខែក្នុងតួនាទី Customer Service Exclusive ពី Sale Supervisor និង Visual Merchandising Manager ក្នុងការទទួលស្គាល់ការអនុវត្តល្អ និងភាពច្នៃប្រឌិត។",
    "pedroAchi1": "ទទួលបាន Top 3 ក្នុងការតាំងបង្ហាញផលិតផលរៀងរាល់ខែ",
    "pedroAchi2": "សម្រេចគោលដៅលក់ជាបន្តបន្ទាប់ និងចំណាត់ថ្នាក់ក្នុង top sales",
    "pedroAchi3": "ចូលរួមប្រកួត role-playing ជាតំណាងម៉ាក",
    "pedroResp1": "ជួយក្នុងការធ្វើផែនការ និងអនុវត្តការតាំងបង្ហាញហាងស្របតាម brand guidelines និងប្រតិបត្តិការតាមរដូវឬ promotional campaigns។",
    "pedroResp2": "ថែទាំ visuals នៃហាងដើម្បីទាក់ទាញអតិថិជន និងបង្កើនភាពច្បាស់លាស់នៃផលិតផល។",
    "pedroResp3": "គ្រប់គ្រង props នៃហាង និងបង្កើតរបាយការណ៍ប្រចាំខែ។",
    "pedroResp4": "សហការជាមួយ merchandising team ដើម្បីអនុវត្តយុទ្ធសាស្រ្ត visual based on sales data, feedback នៃអតិថិជន និង trends ផ្សារ។",
    "pedroResp5": "គ្រប់គ្រងប្រតិបត្តិការ, សំណួរ និង complaints ជាប្រសិទ្ធភាព និងវិជ្ជាជីវៈ។",
    "pedroResp6": "បង្កើតទំនាក់ទំនងល្អជាមួយអតិថិជនតាមរយៈចំណេះដឹងផលិតផល និងជំនួយផ្ទាល់ខ្លួន។",
    "pedroResp7": "សម្រេចគោលដៅលក់ និង satisfaction នៃអតិថិជនជាបន្តបន្ទាប់។",
    "kiwiPosition": "អ្នកគិតលុយ",
    "kiwiWorkTime": "មិថុនា 2020 – មករា 2021",
    "kiwilocation": "ភ្នំពេញ, កម្ពុជា",
    "kiwiAchi1": "ប្រើ POS systems ដើម្បីទទួលប្រាក់ និងពិនិត្យ receipts ឲ្យត្រឹមត្រូវ។",
    "kiwiAchi2": "ជួយបណ្តុះបណ្តាលសមាជិកថ្មីលើ register និងផ្តល់ការណែនាំលើ procedures នៃហាង។",
    "kiwiResp1": "ផ្តល់សេវាកម្ម checkout លឿន, ត្រឹមត្រូវ និងមិត្តភាព ខណៈកំពុងគ្រប់គ្រងវិធីសាស្ត្របង់ប្រាក់នានា ក្នុង retail environment មាន volume ខ្ពស់ និងរាយរបាយការណ៍ទឹកប្រាក់ប្រចាំថ្ងៃ ដោយប្រុងប្រយ័ត្នលើភាពត្រឹមត្រូវ។",
    "kiwiResp2": "ថែទាំ checkout area ឲ្យស្អាត និងមានរបៀបផែនការ, ធានា safety និង neatness។",
    "kiwiResp3": "ប្រើ POS systems ដើម្បីទទួលប្រាក់ (Cash, Card, Voucher) និងពិនិត្យ receipts ត្រឹមត្រូវ។",
    "kiwiResp4": "ជួយបណ្តុះបណ្តាលសមាជិកថ្មីលើ register និងផ្តល់ការណែនាំលើ procedures នៃហាង។",

	"featuredWork": "ស្នាដៃដែលពិសេស",
	"projectTitle1": "សូមមើលស្នាដៃខ្លះៗរបស់ខ្ញុំ។ ខ្ញុំផ្តោតលើការបង្កើតគម្រោងទំនើប បន្សល់ភាពច្នៃប្រឌិត និងងាយស្រួលប្រើ ដែលបង្ហាញទាំងការរចនានិងមុខងារ។ គម្រោងនីមួយៗបង្ហាញពីការប្តេជ្ញាចិត្តរបស់ខ្ញុំចំពោះគុណភាព និងព័ត៌មានលម្អិត។",
	"projectTitle2": "ចង់មើលស្នាដៃបន្ថែមទៀតទេ?",
	"viewAllProject": "មើលគម្រោងទាំងអស់",
	"viewProject": "មើលគម្រោង",
	"viewGithubModal": "មើលកូដប្រភពសម្រាប់កម្មវិធីគ្រប់គ្រងភារកិច្ច",
	"demoProjectTitle": "រូបភាពគម្រោងដែលធើ្វរួម",
	"technology": "បច្ចេកវិទ្យា",
	"details": "ព័ត៌មានលម្អិត",
	"followUs": "តាមដានខ្ញុំ",
	"explore": "ស្វែងយល់",
	"myProject": "គម្រោងរបស់ខ្ញុំ",
    "titleProject": "សាងសង់ដោយសេចក្ដីស្រឡាញ់ ធ្វើឲ្យរីកចម្រើនដោយសេចក្ដីទន្ទឹងបង្គួរ",
    "realTimeProject": "គម្រោងផ្លូវការ",
	"projectCard1": "Personal Portfolio V2.0 ជាគេហទំព័រទំនើប និងឆ្លើយតបទៅនឹងទំហំអេក្រង់ ពីគ្រប់ឧបករណ៍ ដែលបង្កើតឡើងដើម្បីបង្ហាញជំនាញ គម្រោង និងបទពិសោធន៍វិជ្ជាជីវៈរបស់ខ្ញុំ។ វាត្រូវបានអភិវឌ្ឍដោយប្រើ React, TypeScript, Tailwind CSS និង Material UI។ គម្រោងនេះមានចលនារលូន ផ្នែកអន្តរកម្ម និងការរចនាសាមញ្ញស្អាត ដែលបង្ហាញពីការផ្តោតលើប្រសិទ្ធភាព ភាពងាយស្រួលប្រើ។",
	"projectCard2": "គេហទំព័រប័ណ្ណជីវប្រវត្តិផ្ទាល់ខ្លួនទំនើប និងឆ្លើយតបទៅនឹងទំហំអេក្រង់ បង្ហាញពីជំនាញ គម្រោង និងបទពិសោធន៍របស់ខ្ញុំ។ ត្រូវបានបង្កើតឡើងដោយប្រើ React ជាមួយ TypeScript, Tailwind CSS និង Material UI។ វារួមបញ្ចូលផ្នែកអន្តរកម្ម ព្រមទាំងចលនារលូន និងការរចនាស្អាត ដើម្បីបង្ហាញពីការងារអភិវឌ្ឍន៍ និងព័ត៌មានទំនាក់ទំនង។",
	"projectCard3": "គម្រោងបណ្ដុះបណ្ដាលផ្នែក Front-End សម្រាប់គេហទំព័ហាងកាហ្វេ មាន UI ស្អាត ការរៀបចំឆ្លើយតបទៅនឹងទំហំអេក្រង់ និងរចនាសម្ព័ន្ធម៉ូឌុល។ គម្រោងនេះត្រូវបានបង្កើតសម្រាប់ការសិក្សាដោយខ្លួនឯង និងដំណើរការលើកុំព្យូទ័រដោយប្រើ \"npm run dev\"។ វាត្រូវបានបញ្ចូលជាមួយសេវា \"Robert Coffee (Back-End)\" សម្រាប់ការផ្ទៀងផ្ទាត់ការចូលប្រើ និងប្រើ REST APIs សម្រាប់ដំណើរការទិន្នន័យ និងការទំនាក់ទំនង។",
	"projectCard4": "គម្រោងបណ្ដុះបណ្ដាលផ្នែក Back-End ដែលត្រូវបានបង្កើតឡើងដោយប្រើ Laravel និង MySQL ដើម្បីគាំទ្រផ្នែក Front-End របស់ Robert Coffee។ គម្រោងនេះត្រូវបានអភិវឌ្ឍជាផ្នែកមួយនៃដំណើរសិក្សាដោយខ្លួនឯង ដើម្បីហាត់អភិវឌ្ឍន៍ផ្នែក Server-Side។ វាដំណើរការលើកុំព្យូទ័រដោយប្រើ XAMPP Control Panel v3.3.0 និងផ្ដល់ RESTful APIs សម្រាប់ការផ្ទៀងផ្ទាត់ និងប្រតិបត្តិការទិន្នន័យ។",
	"projectCard5": "គេហទំព័រឋិតិវន្តមួយ ត្រូវបានបង្កើតឡើងក្នុងអំឡុងពេលដែលខ្ញុំចាប់ផ្តើមរៀន Framework ផ្នែក Front-End ជាលើកដំបូង។ អភិវឌ្ឍដោយប្រើ Nuxt.js គម្រោងនេះត្រៀមសាកសមនឹងគេហទំព័រការបញ្ជាទិញផលិតផលថែរក្សាស្បែក ហើយជួយឲ្យខ្ញុំយល់អំពីមូលដ្ឋានគ្រឹះរបស់ Vue, Tailwind CSS និងការអភិវឌ្ឍផ្នែក Component។ វាជាគម្រោងសិក្សាផ្ទាល់ខ្លួន ដែលផ្តោតលើរចនាប្លង់ ការតុបតែង និងការបង្ហាញមាតិកាឋិតិវន្ត។",
	"projectCard6": "គេហទំព័រឋិតិវន្តមួយ ត្រូវបានបង្កើតឡើងក្នុងអំឡុងពេលដែលខ្ញុំចាប់ផ្តើមរៀន Framework ផ្នែក Front-End ជាលើកដំបូង។ អភិវឌ្ឍដោយប្រើ Nuxt.js គម្រោងនេះត្រៀមសាកសមនឹងគេហទំព័រការបញ្ជាទិញផលិតផលថែរក្សាស្បែក ជួយឲ្យខ្ញុំយល់អំពីមូលដ្ឋានគ្រឹះរបស់ Vue, Tailwind CSS និងការអភិវឌ្ឍផ្នែក Component។ វាជាគម្រោងសិក្សាផ្ទាល់ខ្លួន ដែលផ្តោតលើរចនាប្លង់ ការតុបតែង និងការបង្ហាញមាតិកាឋិតិវន្ត។",
	"projectCard7": "គេហទំព័រឋិតិវន្តមួយ ត្រូវបានបង្កើតឡើងក្នុងអំឡុងពេលដែលខ្ញុំចាប់ផ្តើមរៀន Framework ផ្នែក Front-End ជាលើកដំបូង។ អភិវឌ្ឍដោយប្រើ Nuxt.js គម្រោងនេះត្រៀមសាកសមនឹងគេហទំព័រការបញ្ជាទិញផលិតផលថែរក្សាស្បែក ជួយឲ្យខ្ញុំយល់អំពីមូលដ្ឋានគ្រឹះរបស់ Vue, Tailwind CSS និងការអភិវឌ្ឍផ្នែក Component។ វាជាគម្រោងសិក្សាផ្ទាល់ខ្លួន ដែលផ្តោតលើរចនាប្លង់ ការតុបតែង និងការបង្ហាញមាតិកាឋិតិវន្ត។",
	"projectCard8": "គម្រោង Nuxt.js មួយ ដែលត្រូវបានបង្កើតឡើងដើម្បីពង្រឹងការយល់ដឹងរបស់ខ្ញុំអំពី Framework Front-End ទំនើប និងការរួមបញ្ចូល REST API។ កម្មវិធីនេះបង្ហាញប្រវត្តិរូបអ្នកថតរូប និងមតិយោបល់អតិថិជន ដោយទាញទិន្នន័យ Dynamic ពី Backend API។ វាត្រូវបានអភិវឌ្ឍជាការហាត់សិក្សាដោយខ្លួនឯង ដោយប្រើ TypeScript និង Tailwind CSS។ គម្រោងនេះដំណើរការលើកុំព្យូទ័រ ដោយប្រើ \"npm run dev\" សម្រាប់ Client ហើយបើក Terminal មួយទៀតដើម្បីរត់ពាក្យបញ្ជា \"npx json-server --watch static/data/photographyDb.json --port 3001\" សម្រាប់ Backend។",
	"projectCard9": "អភិវឌ្ឍផ្ទាំងមុខ (frontend) របស់ Gtech Admin panel ដោយអនុវត្ត UI components ដែលឆ្លើយតបទៅនឹងទំហំអេក្រង់ និងបញ្ចូលជាមួយ Backend APIs។ ផ្តោតលើការបញ្ឆេះកំហុស (debugging) កែលម្អបទពិសោធន៍អ្នកប្រើ និងធានាបាននូវការរួមបញ្ចូលរលូនជាមួយផ្ទាំងគ្រប់គ្រង (admin dashboard)។",
	"projectCard10": "បានធ្វើការថែទាំ និងកែលម្អគេហទំព័រ Gtech Cambodia។ អនុវត្តការរួមបញ្ចូល API, បង្កើនប្រសិទ្ធភាព frontend, និងធានាការចុះស្របក្នុងកម្មវិធីគ្រប់ប្រភេទ Browser។ ផ្តោតលើ UI ស្អាត និងចលនារលូនសម្រាប់អ្នកប្រើ។",
	"projectCard11": "បានសង់ផ្ទាំងមុខ Dashboard សម្រាប់ Sambot Digital Admin ដោយបង្កើត components អន្តរកម្ម និងធានាការរួមបញ្ចូលរលូនជាមួយ Backend APIs។ ផ្តោតលើការកែលម្អបទពិសោធន៍អ្នកប្រើ និងផ្ដល់ចរន្តការងារដែលមានប្រសិទ្ធភាពសម្រាប់ការគ្រប់គ្រងឌីជីថល។",
	"projectCard12": "បានអភិវឌ្ឍ templates ផ្ទាំងមុខដែលអាចប្រើឡើងវិញសម្រាប់ Sambot Digital Mail system។ តាមដាន UI guidelines ដើម្បីបង្កើតវេទិកាអ៊ីមែលឌីជីថល សម្រាប់អតិថិជនក្នុងការផ្ញើការអញ្ជើញសម្រាប់ពិធីផ្សេងៗ ដូចជា ពិធីមង្គលការ ថ្ងៃកំណើត និងព្រឹត្តិការណ៍ផ្សេងៗ។",
	"projectCard13": "បានអភិវឌ្ឍផ្ទាំងមុខសម្រាប់ Samphat Motobike POS System។ អនុវត្ត layouts ដែលឆ្លើយតបទៅនឹងទំហំអេក្រង់, components អន្តរកម្ម, និងការរុករករលូន ដើម្បីបង្កើនបទពិសោធន៍សម្រាប់បុគ្គលិកក្នុងការគ្រប់គ្រងការបញ្ជាទិញ និងស្តុកឃ្លាំង។",



	"contactTitle1": "យើងធ្វើការជាមួយគ្នា",
	"contactTitle2": "សួស្តី! ខ្ញុំសង្ឃឹមថាអ្នកកំពុងមានថ្ងៃល្អ។ វាពិតជាសប្បាយចិត្តក្នុងការតភ្ជាប់ និងចែករំលែកអារម្មណ៍ល្អជាមួយអ្នកផ្សេងទៀត!",
	"contactTitle3": "ស្កេនកូដ QR ខាងក្រោមដើម្បីគាំទ្រខ្ញុំ។ អរគុណច្រើន! 🙏",
	"getInTouch": "ទំនាក់ទំនងមកខ្ញុំ",
    "getInTouch2": "ខ្ញុំចង់ស្តាប់ពីអ្នក! សូមទំនាក់ទំនងមកខ្ញុំបានគ្រប់ពេល និងសូមសួរស្តី។",
    "connectWithMe": "ភ្ជាប់ទំនាក់ទំនងជាមួយខ្ញុំ",
    "connectWithMe2": "សូមទំនាក់ទំនងមកខ្ញុំបានគ្រប់ពេល — ខ្ញុំតែងតែរីករាយក្នុងការជួបមនុស្សថ្មី និងចែករំលែកគំនិត!",
	"supportMe": "គាំទ្រខ្ញុំ",
	"sendEmail": "ផ្ញើអ៊ីមែល",
	"sendingEmail": "កំពុងផ្ញើអ៊ីមែល",
	"sendingpara": "សួស្តី! សូមបំពេញបែបបទខាងក្រោម ហើយខ្ញុំនឹងទំនាក់ទំនងអ្នកឆាប់ៗនេះ។",
	"sendMessage": "ផ្ញើសារ",
	"sending": "កំពុងផ្ញើ...",
	"nameCon": "ឈ្មោះ",
	"namePlaceholder": "ឈ្មោះពេញរបស់អ្នក",
	"subject": "ប្រធានបទ",
	"subjectPlaceholder": "នេះអំពីអ្វី?",
	"message": "សារ",
	"messagePlaceholder": "សរសេរសារ...",

	"quickLink": "តំណភ្ជាប់រហ័ស",
	"footerTitle1": "តោះភ្ជាប់ជាមួយខ្ញុំ",
	"footerTitle2": "តែងតែចាប់អារម្មណ៍លើឱកាសថ្មីៗ និងការសហការថ្មីៗ។",
	"2025": "២០២៥",
	"designFt": "រចនា",
	"coded": "សរសេរកូដ",
	"byFt": "ដោយ នីម វឌ្ឍា",
	"viewPortflio": "មើលផតហ្វូលីយោខ្ញុំ",
	"callMe": "តេមកខ្ញុំ",
	"sayHelloTelegram": "សួស្តីតាម Telegram របស់ខ្ញុំ!",
	"latestWork": "ការងារថ្មីៗ",
	"demoProject": "វីដេអូគម្រោងសាកល្បង"
}
